script.yaml
config:
  target: '<url>'
  phases:
    - duration: 2
      arrivalRate: 1
  payload:
    path: "inputs.csv"
    order: "sequence"
    fields:
      - "a"
      - "b"
      - "c"
scenarios:
  - flow:
    - log: "New virtual user running"
    - post:
        url: "/v1"
        json:
          input: "{{ a }},{{ b }},{{ c }}"